In [1]:
# Initialize data to lists.
data = {'Fruits': ["Mango","Orenge","Banana"], "Quantity":[12,13,14],"Prise":[100,150,200]}

In [2]:
data

{'Fruits': ['Mango', 'Orenge', 'Banana'],
 'Quantity': [12, 13, 14],
 'Prise': [100, 150, 200]}

In [3]:
type(data)

dict

In [4]:

# importing the pandas libary
import pandas as pd

 
# Creates DataFrame.
df = pd.DataFrame(data)
 
# Print the data
print(df)

   Fruits  Quantity  Prise
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200

In [5]:
 df.head()

   Fruits  Quantity  Prise
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200

In [6]:
 df.dtypes

Fruits      object
Quantity     int64
Prise        int64
dtype: object

In [7]:
df.shape

(3, 3)

In [8]:
df.info

<bound method DataFrame.info of    Fruits  Quantity  Prise
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200>

In [9]:
df.describe

<bound method NDFrame.describe of    Fruits  Quantity  Prise
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200>

In [10]:
df.sort_values("Prise",ascending=False)

   Fruits  Quantity  Prise
2  Banana        14    200
1  Orenge        13    150
0   Mango        12    100

In [11]:
df.sort_values("Quantity",ascending=False)

   Fruits  Quantity  Prise
2  Banana        14    200
1  Orenge        13    150
0   Mango        12    100

In [12]:
df.sort_index(ascending=True)

   Fruits  Quantity  Prise
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200

In [13]:
df

   Fruits  Quantity  Prise
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200

In [14]:
df.rename

<bound method DataFrame.rename of    Fruits  Quantity  Prise
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200>

In [15]:
df.rename(columns = {'Fruits':'FRUITS','Quantity':'QUANTITY','Prise':'PRICE'}, inplace = True)

In [16]:
df

   FRUITS  QUANTITY  PRICE
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200

In [17]:
df.columns

Index(['FRUITS', 'QUANTITY', 'PRICE'], dtype='object')

In [18]:
#row and coloumns inter changes
pd.melt(df)

   variable   value
0    FRUITS   Mango
1    FRUITS  Orenge
2    FRUITS  Banana
3  QUANTITY      12
4  QUANTITY      13
5  QUANTITY      14
6     PRICE     100
7     PRICE     150
8     PRICE     200

In [19]:
df[1:3]

   FRUITS  QUANTITY  PRICE
1  Orenge        13    150
2  Banana        14    200

In [20]:
# we chack random sample of exesting rows
df.sample(2)

   FRUITS  QUANTITY  PRICE
0   Mango        12    100
2  Banana        14    200

In [21]:
# extract largest numbers 
df.nlargest(1,'QUANTITY')

   FRUITS  QUANTITY  PRICE
2  Banana        14    200

In [23]:
# extract largest numbers 
df.nsmallest(1,'QUANTITY')

  FRUITS  QUANTITY  PRICE
0  Mango        12    100

In [26]:
df.loc[0:2]

   FRUITS  QUANTITY  PRICE
0   Mango        12    100
1  Orenge        13    150
2  Banana        14    200

In [27]:
df.iloc[0:2]

   FRUITS  QUANTITY  PRICE
0   Mango        12    100
1  Orenge        13    150

In [30]:
df.to_csv("C:/Users/dipan/OneDrive/Desktop/BIA_MARRY/Stmarry_Hydrabad/python/day_1/Fruits.csv")